FSI/flap_perp/OpenFOAM-CalculiX_interFoam/Fluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          1e-04;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           2;
maxAlphaCo      1;
nAlphaSubCycles=5;
maxDeltaT       1;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
//         libs ("libpreciceAdapterFunctionObject.so");
        libs ("libpreciceAdapterFunctionObject_interFoam.so");
//         libs ("libpreciceAdapterFunctionObject_XDEM.so");
    }
}
// ************************************************************************* //
